YCSB Outputs/Workload C/runc2
[WARN]  Running against a source checkout. In order to get our runtime dependencies we'll have to invoke Maven. Depending on the state of your system, this may take ~30-45 seconds
[DEBUG]  Running 'mvn -pl site.ycsb:mongodb-binding -am package -DskipTests dependency:build-classpath -DincludeScope=compile -Dmdep.outputFilterFile=true'
WARNING: An illegal reflective access operation has occurred
WARNING: Illegal reflective access by com.google.inject.internal.cglib.core.$ReflectUtils$1 (file:/usr/share/maven/lib/guice.jar) to method java.lang.ClassLoader.defineClass(java.lang.String,byte[],int,int,java.security.ProtectionDomain)
WARNING: Please consider reporting this to the maintainers of com.google.inject.internal.cglib.core.$ReflectUtils$1
WARNING: Use --illegal-access=warn to enable warnings of further illegal reflective access operations
WARNING: All illegal access operations will be denied in a future release
java -cp /home/swan/YCSB/mongodb/conf:/home/swan/YCSB/mongodb/target/mongodb-binding-0.18.0-SNAPSHOT.jar:/home/swan/.m2/repository/org/apache/htrace/htrace-core4/4.1.0-incubating/htrace-core4-4.1.0-incubating.jar:/home/swan/.m2/repository/org/xerial/snappy/snappy-java/1.1.7.1/snappy-java-1.1.7.1.jar:/home/swan/.m2/repository/org/hdrhistogram/HdrHistogram/2.1.4/HdrHistogram-2.1.4.jar:/home/swan/.m2/repository/org/mongodb/mongo-java-driver/3.11.0/mongo-java-driver-3.11.0.jar:/home/swan/.m2/repository/org/codehaus/jackson/jackson-mapper-asl/1.9.4/jackson-mapper-asl-1.9.4.jar:/home/swan/.m2/repository/org/codehaus/jackson/jackson-core-asl/1.9.4/jackson-core-asl-1.9.4.jar:/home/swan/YCSB/core/target/core-0.18.0-SNAPSHOT.jar:/home/swan/.m2/repository/com/allanbank/mongodb-async-driver/2.0.1/mongodb-async-driver-2.0.1.jar site.ycsb.Client -db site.ycsb.db.MongoDbClient -s -t -P workloads/workloadc -p operationcount=200000 -threads 16 -p mongodb.url=mongodb://localhost:27017/yscb -p mongodb.auth=true -t
Command line: -db site.ycsb.db.MongoDbClient -s -t -P workloads/workloadc -p operationcount=200000 -threads 16 -p mongodb.url=mongodb://localhost:27017/yscb -p mongodb.auth=true -t
YCSB Client 0.18.0-SNAPSHOT

Loading workload...
Starting test.
2020-04-24 07:06:18:167 0 sec: 0 operations; est completion in 0 second 
Apr 24, 2020 7:06:18 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster created with settings {hosts=[localhost:27017], mode=SINGLE, requiredClusterType=UNKNOWN, serverSelectionTimeout='30000 ms', maxWaitQueueSize=500}
mongo client connection created with mongodb://localhost:27017/yscb
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
[...]
Apr 24, 2020 7:06:18 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Apr 24, 2020 7:06:18 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Apr 24, 2020 7:06:18 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Apr 24, 2020 7:06:18 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Apr 24, 2020 7:06:18 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Apr 24, 2020 7:06:18 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Apr 24, 2020 7:06:18 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Apr 24, 2020 7:06:18 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Apr 24, 2020 7:06:18 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Apr 24, 2020 7:06:18 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Apr 24, 2020 7:06:18 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Apr 24, 2020 7:06:18 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Apr 24, 2020 7:06:18 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Apr 24, 2020 7:06:18 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Apr 24, 2020 7:06:18 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Apr 24, 2020 7:06:18 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Apr 24, 2020 7:06:18 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:1, serverValue:387}] to localhost:27017
Apr 24, 2020 7:06:18 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Monitor thread successfully connected to server with description ServerDescription{address=localhost:27017, type=STANDALONE, state=CONNECTED, ok=true, version=ServerVersion{versionList=[4, 2, 6]}, minWireVersion=0, maxWireVersion=8, maxDocumentSize=16777216, logicalSessionTimeoutMinutes=30, roundTripTimeNanos=6847008}
Apr 24, 2020 7:06:18 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:15, serverValue:400}] to localhost:27017
Apr 24, 2020 7:06:18 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:12, serverValue:397}] to localhost:27017
Apr 24, 2020 7:06:18 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:6, serverValue:391}] to localhost:27017
Apr 24, 2020 7:06:18 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:8, serverValue:394}] to localhost:27017
Apr 24, 2020 7:06:18 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:10, serverValue:393}] to localhost:27017
Apr 24, 2020 7:06:18 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:16, serverValue:402}] to localhost:27017
Apr 24, 2020 7:06:18 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:17, serverValue:401}] to localhost:27017
Apr 24, 2020 7:06:18 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:11, serverValue:395}] to localhost:27017
Apr 24, 2020 7:06:18 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:5, serverValue:390}] to localhost:27017
Apr 24, 2020 7:06:18 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:3, serverValue:389}] to localhost:27017
Apr 24, 2020 7:06:18 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:4, serverValue:403}] to localhost:27017
Apr 24, 2020 7:06:18 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:2, serverValue:388}] to localhost:27017
Apr 24, 2020 7:06:18 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:14, serverValue:399}] to localhost:27017
Apr 24, 2020 7:06:18 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:9, serverValue:392}] to localhost:27017
Apr 24, 2020 7:06:18 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:7, serverValue:398}] to localhost:27017
Apr 24, 2020 7:06:18 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:13, serverValue:396}] to localhost:27017
2020-04-24 07:06:28:100 10 sec: 110066 operations; 11005.5 current ops/sec; est completion in 9 second [READ: Count=110119, Max=293375, Min=136, Avg=1350.9, 90=2227, 99=6439, 99.9=17855, 99.99=271359] 
Apr 24, 2020 7:06:33 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:5, serverValue:390}] to localhost:27017 because the pool has been closed.
Apr 24, 2020 7:06:33 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:7, serverValue:398}] to localhost:27017 because the pool has been closed.
Apr 24, 2020 7:06:33 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:13, serverValue:396}] to localhost:27017 because the pool has been closed.
Apr 24, 2020 7:06:33 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:2, serverValue:388}] to localhost:27017 because the pool has been closed.
Apr 24, 2020 7:06:33 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:11, serverValue:395}] to localhost:27017 because the pool has been closed.
Apr 24, 2020 7:06:33 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:12, serverValue:397}] to localhost:27017 because the pool has been closed.
Apr 24, 2020 7:06:33 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:3, serverValue:389}] to localhost:27017 because the pool has been closed.
Apr 24, 2020 7:06:33 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:10, serverValue:393}] to localhost:27017 because the pool has been closed.
Apr 24, 2020 7:06:33 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:9, serverValue:392}] to localhost:27017 because the pool has been closed.
Apr 24, 2020 7:06:33 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:4, serverValue:403}] to localhost:27017 because the pool has been closed.
Apr 24, 2020 7:06:33 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:6, serverValue:391}] to localhost:27017 because the pool has been closed.
Apr 24, 2020 7:06:33 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:8, serverValue:394}] to localhost:27017 because the pool has been closed.
Apr 24, 2020 7:06:33 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:17, serverValue:401}] to localhost:27017 because the pool has been closed.
Apr 24, 2020 7:06:33 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:15, serverValue:400}] to localhost:27017 because the pool has been closed.
Apr 24, 2020 7:06:33 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:16, serverValue:402}] to localhost:27017 because the pool has been closed.
Apr 24, 2020 7:06:33 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:14, serverValue:399}] to localhost:27017 because the pool has been closed.
2020-04-24 07:06:33:430 15 sec: 200000 operations; 16873.17 current ops/sec; [READ: Count=89881, Max=314111, Min=114, Avg=858.37, 90=1472, 99=3941, 99.9=10615, 99.99=28351] [CLEANUP: Count=16, Max=89663, Min=0, Avg=5603.88, 90=2, 99=89663, 99.9=89663, 99.99=89663] 
[OVERALL], RunTime(ms), 15331
[OVERALL], Throughput(ops/sec), 13045.46344008871
[TOTAL_GCS_G1_Young_Generation], Count, 160
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 224
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 1.4610919052899356
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 160
[TOTAL_GC_TIME], Time(ms), 224
[TOTAL_GC_TIME_%], Time(%), 1.4610919052899356
[READ], Operations, 200000
[READ], AverageLatency(us), 1129.553595
[READ], MinLatency(us), 114
[READ], MaxLatency(us), 314111
[READ], 95thPercentileLatency(us), 2613
[READ], 99thPercentileLatency(us), 5667
[READ], Return=OK, 200000
[CLEANUP], Operations, 16
[CLEANUP], AverageLatency(us), 5603.875
[CLEANUP], MinLatency(us), 0
[CLEANUP], MaxLatency(us), 89663
[CLEANUP], 95thPercentileLatency(us), 9
[CLEANUP], 99thPercentileLatency(us), 89663